{
  "bullets": [
    { "label": "Education", "icon": "FaGraduationCap" },
    { "label": "Work History", "icon": "FaBriefcase" },
    { "label": "Skills", "icon": "FaCode" },
    { "label": "Projects", "icon": "FaTasks" },
    { "label": "languages", "icon": "FaLanguage" }
  ],
  "education": [
    {
      "heading": "Dublin Business School, Dublin, Ireland ",
      "subHeading": "Higher Diploma in Science in Computing (Web & Cloud Technologies)",
      "fromDate": "2022",
      "toDate": "2024"
    },
    {
      "heading": "Dublin Business School, Dublin, Ireland ",
      "subHeading": "BA (Honours) in Digital Marketing and Cloud Computing",
      "fromDate": "2016",
      "toDate": "2020"
    }
  ],
  "workHistory": [
    {
      "heading": "Amazon Web Services (AWS)",
      "subHeading": "Account Access Management Specialist",
      "fromDate": "2022",
      "toDate": "Present",
      "descriptions": [
        "This role allowed me to gain hands-on experience in cloud and network security while collaborating with cross-functional engineering teams to resolve complex account-related issues." ,
        "By leveraging my expertise in AWS services, I ensured account security and contributed to resolving customer support escalations effectively.",
        " My comprehensive understanding of AWS products and services enabled me to guide customers in adopting tailored solutions while maintaining a balance between technical problem-solving and clear communication."
      ]
    },
    {
      "heading": "Freelance Web Developer",
      "subHeading": "Freelance Web Developer",
      "fromDate": "2022",
      "toDate": "Present",
      "descriptions": [
        "As a Web Developer and Designer, I focus on creating and managing responsive websites using technologies such as React, Node.js, and MongoDB. My work includes developing user-friendly interfaces, ensuring functionality, and delivering scalable solutions tailored to client needs.",
        "I have designed and deployed websites for various industries, translating client requirements into effective designs while optimizing performance and cross-device compatibility. My experience includes API integration, implementing security measures, and deploying projects on AWS for reliable hosting and scalability"
      ]
    }
  ],
  "skills": [
    { "skill": "JavaScript", "ratingPercentage": 85 },
    { "skill": "Typescript", "ratingPercentage": 80 },
    { "skill": "React JS", "ratingPercentage": 85 },
    { "skill": "Express JS", "ratingPercentage": 89 },
    { "skill": "Node JS", "ratingPercentage": 89 },
    { "skill": "Mongo DB", "ratingPercentage": 70 }
  ],
  "projects": [
    {
      "title": "Personal Portfolio Website",
      "duration": { "fromDate": "2020", "toDate": "2021" },
      "description": "Personal portfolio website to showcase my skills, experiences, and projects as a Full Stack Developer and Web Designer.",
      "subHeading": "Technologies Used: React JS, Typescript, MongoDB, AWS"
    },
    {
      "title": "E-commerce Mocked Website",
      "duration": { "fromDate": "2020", "toDate": "2021" },
      "description": "Designing and developing a mocked e-commerce website for GymBs, a fictional fitness apparel and accessories brand, to serve as a proof-of-concept for modern e-commerce solutions.",
      "subHeading": "Technologies Used: React JS, Typescript, MongoDB, AWS, Express JS, Node JS"
    },
    {
      "title": "Magic Rainbow Painting and Decorating",
      "duration": { "fromDate": "2022", "toDate": "2023" },
      "description": "A Website for Magic Rainbow Painting and Decorating, a painting and decorating service company",
      "subHeading": "Technologies Used: React JS, Typescript, MongoDB, AWS"
    },
    {
      "title": "Art Wall Ireland Website",
      "duration": { "fromDate": "2020", "toDate": "2021" },
      "description": "A website for Art Wall Ireland, a company specializing in vertical Printing on walls",
      "subHeading": "Technologies Used: HTML, CSS, JavaScript, AWS"
    }
  ],
  "languages": [
    {
      "heading": "English",
      "description": "Proficient in English, with a deep understanding of both written and spoken forms of the language. Skilled in crafting clear, articulate, and professional written content, ranging from reports and correspondence to presentations and proposals. Equally adept in verbal communication, capable of engaging in complex discussions, negotiations, and public speaking. This expertise allows for effective communication in diverse professional environments, ensuring clarity, precision, and cultural adaptability."
    },
    {
      "heading": "Portuguese",
      "description": "Fluent in Portuguese, with advanced proficiency in all areas of communication, including speaking, writing, and comprehension. Demonstrates the ability to engage effectively in both formal and informal settings, ensuring clear, precise, and culturally nuanced communication. Capable of drafting professional documents, engaging in high-level conversations, and delivering presentations in Portuguese, all while maintaining accuracy and attention to detail. This linguistic skill supports seamless interactions in diverse environments, enhancing collaboration and productivity."
    }
  ]
}


